In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
df = pd.read_csv('F:\Database\\Bengaluru_House_Data.csv')

In [2]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [4]:
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [5]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [6]:
df["size"] =df["size"].replace(to_replace=("1 BHK",'1 Bedroom',"1 RK","2 BHK","2 Bedroom","3 BHK", "3 Bedroom","4 Bedroom","4 BHK"), 
                               value=("1","1","1","2","2","3","3","4","4"))
df =df.replace(to_replace=('5 BHK','5 Bedroom'), value="5")
df =df.replace(to_replace=("6 Bedroom",'6 BHK'), value="6")
df =df.replace(to_replace=('7 Bedroom','7 BHK'), value="7")
df =df.replace(to_replace=('8 Bedroom', '8 BHK'), value="8")
df =df.replace(to_replace=('9 Bedroom','9 BHK'), value="9")
df =df.replace(to_replace=('10 Bedroom', '10 BHK'), value="10")
df =df.replace(to_replace=('11 BHK', '11 Bedroom'), value="11")
df =df.replace(to_replace='12 Bedroom', value="12")
df =df.replace(to_replace='13 BHK', value="13")
df =df.replace(to_replace='14 BHK', value="14")
df =df.replace(to_replace='19 BHK', value="19")
df =df.replace(to_replace='16 BHK', value="16")
df =df.replace(to_replace='18 Bedroom', value="18")
df =df.replace(to_replace='27 BHK', value="27")
df =df.replace(to_replace='43 Bedroom', value="43")

In [7]:
df["size"].unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', nan, '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [8]:
df["size"]=df['size'].replace(to_replace= np.nan, value = 1)

In [9]:
df["size"].unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', 1, '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [10]:
df["size"] = df["size"].astype(int)

In [11]:
df = df.sort_values(by=['location'])

In [12]:
df = df.iloc[:-1,:]
df.isnull().sum()

area_type          0
availability       0
location           0
size               0
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [13]:
df["bath"]=df['bath'].replace(to_replace= np.nan, value =0)

In [14]:
df["balcony"]=df['balcony'].replace(to_replace= np.nan, value ="0")

In [15]:
df = df.dropna()
df.isnull().sum()

area_type       0
availability    0
location        0
size            0
society         0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [16]:
df.shape

(7817, 9)

In [17]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
8385,Super built-up Area,Ready To Move,Banaswadi,1,Krntsee,527,1.0,0,35.00
2486,Super built-up Area,19-Dec,Bhoganhalli,1,Rosha I,296,1.0,0,22.89
6000,Super built-up Area,Ready To Move,Devarabeesana Halli,3,Sorisa,1670,3.0,2,160.00
6120,Super built-up Area,Ready To Move,Devarabeesana Halli,3,Sorisa,1750,3.0,2,150.00
3281,Super built-up Area,Ready To Move,Devarabeesana Halli,3,Sorisa,1672,3.0,2,150.00

In [18]:
df = df.sort_values(by=["price"])

In [19]:
df["location"] = df["location"].replace(to_replace=df["location"].unique(), 
                                               value= np.arange(len(df["location"].unique())))

In [20]:
df["society"] = df["society"].replace(to_replace=df["society"].unique(), 
                                               value= np.arange(len(df["society"].unique())))

In [21]:
df = df.sort_values(by=["availability"])
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
11996,Built-up Area,14-Jul,226,3,546,1410,2.0,2,43.71
8981,Built-up Area,15-Aug,5,2,1292,1225,2.0,2,62.00
7138,Built-up Area,15-Dec,573,3,2300,1200,2.0,0,130.00
3718,Built-up Area,15-Jun,401,3,2073,1500,2.0,0,97.00
3472,Super built-up Area,15-Nov,422,3,2077,1760,3.0,0,150.00

In [22]:
df["availability"] = df["availability"].replace(to_replace=df["availability"].unique(), 
                                               value= np.arange(len(df["availability"].unique())))

In [23]:
df["area_type"] =df["area_type"].replace(to_replace=('Built-up  Area','Super built-up  Area', 'Plot  Area','Carpet  Area'), 
                                         value=("3","4","2","1"))

In [24]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
11996,3,0,226,3,546,1410,2.0,2,43.71
8981,3,1,5,2,1292,1225,2.0,2,62.00
7138,3,2,573,3,2300,1200,2.0,0,130.00
3718,3,3,401,3,2073,1500,2.0,0,97.00
3472,4,4,422,3,2077,1760,3.0,0,150.00

In [25]:
df['price'].dtype

dtype('float64')

In [26]:
df["balcony"].dtype

dtype('O')

In [27]:
df["balcony"] = df["balcony"].astype(int)

In [28]:
df["balcony"].dtype

dtype('int32')

In [29]:
df['bath'].dtype

dtype('float64')

In [30]:
df['total_sqft'].dtype

dtype('O')

In [31]:
df['total_sqft'] = df['total_sqft'].convert_dtypes()

In [32]:
df['total_sqft'] = pd.to_numeric(df['total_sqft'], errors ='coerce')

In [33]:
df['total_sqft'].dtype

dtype('float64')

In [34]:
df.isnull().sum()

area_type         0
availability      0
location          0
size              0
society           0
total_sqft      217
bath              0
balcony           0
price             0
dtype: int64

In [35]:
df['total_sqft'] = df['total_sqft'].fillna(df['total_sqft'].mean())

In [36]:
df['total_sqft'].dtype

dtype('float64')

In [37]:
df.isnull().sum()

area_type       0
availability    0
location        0
size            0
society         0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [38]:
df['society'].dtype

dtype('int64')

In [39]:
df["size"].dtype

dtype('int32')

In [40]:
df["location"].dtype

dtype('int64')

In [41]:
df["availability"].dtype

dtype('int64')

In [42]:
df["area_type"].dtype

dtype('O')

In [43]:
df["area_type"] = df["area_type"].astype(int)

In [44]:
df["area_type"].dtype

dtype('int32')

In [45]:
df.isnull().sum()

area_type       0
availability    0
location        0
size            0
society         0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [46]:
df.sort_values(by="area_type")

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
1776,1,76,602,3,2441,1650.000000,3.0,3,175.00
1181,1,76,90,2,166,910.000000,2.0,1,30.50
3424,1,25,332,4,57,1451.500000,4.0,1,121.00
10907,1,76,83,2,320,866.280000,2.0,0,36.38
9319,1,76,78,2,140,775.000000,2.0,2,29.50
...,...,...,...,...,...,...,...,...,...
9719,4,76,417,3,2372,2223.000000,3.0,2,300.00
10822,4,76,283,4,2037,4303.000000,5.0,0,300.00
8127,4,76,195,4,2503,3205.000000,4.0,2,300.00
4210,4,76,255,3,2579,1542.061812,0.0,0,293.00
3180,4,76,606,5,2687,8321.000000,5.0,3,2700.00

In [47]:
df.iloc[4210]

area_type          3.0
availability      76.0
location         171.0
size               3.0
society         2327.0
total_sqft      1850.0
bath               3.0
balcony            1.0
price            150.0
Name: 343, dtype: float64

In [48]:
df = df.drop(index=4210)

In [49]:
df.sort_values(by="area_type")

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
1776,1,76,602,3,2441,1650.00,3.0,3,175.00
1181,1,76,90,2,166,910.00,2.0,1,30.50
3424,1,25,332,4,57,1451.50,4.0,1,121.00
10907,1,76,83,2,320,866.28,2.0,0,36.38
9319,1,76,78,2,140,775.00,2.0,2,29.50
...,...,...,...,...,...,...,...,...,...
9719,4,76,417,3,2372,2223.00,3.0,2,300.00
10822,4,76,283,4,2037,4303.00,5.0,0,300.00
8127,4,76,195,4,2503,3205.00,4.0,2,300.00
9724,4,31,45,2,176,1143.00,2.0,1,34.20
3180,4,76,606,5,2687,8321.00,5.0,3,2700.00

In [50]:
df = df.reset_index(drop=True)

In [51]:
df["total_sqft"].dtype

dtype('float64')

In [52]:
df["total_sqft"] = df["total_sqft"].astype(int)

In [53]:
x = pd.DataFrame(df.iloc[:,:-1])
y = pd.DataFrame(df.iloc[:,-1])

In [54]:
from sklearn import linear_model
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=12)

In [55]:
from sklearn.linear_model import LinearRegression
rgn=LinearRegression()
rgn.fit(x_train, y_train)

LinearRegression()

In [56]:
print(rgn.coef_)

[[-11.26589574  -0.3004515    0.05863179   2.56337739   0.03038639
    0.05346833  19.93901119  -7.85924158]]

In [57]:
y_pred = rgn.predict(x_test)
print(y_pred)

[[122.70496744]
 [ 91.17148683]
 [ 59.32505009]
 ...
 [ 55.76269049]
 [ 44.69019228]
 [ 84.63748719]]

In [58]:
print(y_test)

      price
2137  83.00
2126  84.00
7673  58.00
7804  60.00
2555  94.71
...     ...
6885  73.00
6923  72.00
4659  43.09
7522  63.00
6462  65.00

[1564 rows x 1 columns]

In [59]:
print("Accuracy",(rgn.score(x_test,y_test)))

Accuracy 0.6021113669414977